Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindings.AddCategories(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ForgeTypeId})
Adds multiple categories to the bindings.
categories:
Identifiers of the categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindings.AddCategory(Autodesk.Revit.DB.ForgeTypeId)
Adds a category id to the bindings.
categoryId:
Identifier of the category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindings.BindingType
Indicates type vs instance bindings. Defaults to Instance.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindings.#ctor(Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindingType,System.Collections.Generic.ISet{Autodesk.Revit.DB.ForgeTypeId})
Creates a new ExtendedPropertiesBindings
bindingType:
Binding type.
boundCategories:
Identifiers of the categories for this binding.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindings.#ctor
Creates a new ExtendedPropertiesBindings
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindings
Establishes the bindings for a given extended property.
Supports the same style of binding as shared/project parameters - category and type vs instance.
Since:
2027